dsa18/PORIGE/Workspace03/Design01.cydsn/Generated_Source/PSoC5/Power_In.h
/*******************************************************************************
* File Name: Power_In.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_Power_In_H) /* CY_STATUS_REG_Power_In_H */
#define CY_STATUS_REG_Power_In_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} Power_In_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 Power_In_Read(void) ;
void Power_In_InterruptEnable(void) ;
void Power_In_InterruptDisable(void) ;
void Power_In_WriteMask(uint8 mask) ;
uint8 Power_In_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define Power_In_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define Power_In_INPUTS              1


/***************************************
*             Registers
***************************************/

/* Status Register */
#define Power_In_Status             (* (reg8 *) Power_In_sts_sts_reg__STATUS_REG )
#define Power_In_Status_PTR         (  (reg8 *) Power_In_sts_sts_reg__STATUS_REG )
#define Power_In_Status_Mask        (* (reg8 *) Power_In_sts_sts_reg__MASK_REG )
#define Power_In_Status_Aux_Ctrl    (* (reg8 *) Power_In_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_Power_In_H */


/* [] END OF FILE */
